<template>
  <ConfigProvider>
    <Container navbar-title="用户协议" content-class="px-[16px]">
      <h2 class="font-bold">树懒不会上树用户协议</h2>
      <h3>第一条 协议接受</h3>
      <p>
        欢迎来到树懒不会上树，感谢浏览。树懒不会上树提供包括信息浏览、发布等服务(以下称“服务”)。无论您以任何方式使用服务，均被认为您已经阅读和接受本协议。您需要经常查看本协议，以便及时知晓这些修订，也欢迎您联系我们把您的问题反馈给我们。
      </p>
      <h3>第二条 关于限制未满16周岁人员注册树懒不会上树的声明</h3>
      <p>1.在未得到未成年人监护人的允许或事先声明情况下，树懒不会上树不会在线收集任何未成年人的联系信息(包括姓名、地址、学校及联系方式)，亦不会在未得到未成年人监护人允许下，向任何人第三方传送可被识别的未成年人个人信息。</p>
      <p>2.为保护少年儿童的身心健康，促进义务教育，根据相关法规，特此声明如下:限制未满16周岁人员注册树懒不会上树会员，由此引发的任何问题责任均由用户本人承担。</p>
      <h3>第三条 免责条款</h3>
      <p>
        树懒不会上树并未随时监视此页面，但保留进行随时监视的权利。对于非树懒不会上树公布的内容，树懒不会上树一概不负任何责任。使用者承认并同意，信息发布方对存入简历中心的个人简历及材料的格式、内容的真实性准确性和合法性负有全部责任，信息发布方对于其在职位中公布内容的真实性、准确性和合法性负有全部责任，对于通过树懒不会上树聘用的志愿者，树懒不会上树必须积极结算对应补贴工资，不得拖欠补贴。通过树懒不会上树平台发放的工资、补贴等所有费用，均为发布方通过平台代发，并非由树懒不会上树直接发放，即用户与树懒不会上树之间不存在任何劳务、劳动关系，亦不承担相关法律责任。
      </p>
      <p>对于树懒不会上树为使用者提供便利而设置的外部链接网址的任何信息，树懒不会上树并不保证信息的真实性、准确性、安全性和完整性，亦并不代表对其内容的认可，请使用者谨慎确认后使用，树懒不会上树对由此导致的任何损失或伤害不承担任何责任。</p>
      <h3>第四条 使用规则</h3>
      <p>树懒不会上树只能用于合法目的，即平台为个人提供便利，用于寻找志愿者岗位和赠送对应福利。树懒不会上树明确禁止任何其他用途，并要求所有使用者同意不用于下列任何一种用途:</p>
      <p>1.在个人认证中心公布不完整虚假或不准确的个人信息资料，或不是本人的准确资料(而替代他人寻找)。</p>
      <p>2.公布不是相关的资料，如意见、通知、商业广告或其他非简历内容。</p>
      <p>3.为树懒不会上树的竞争同行回应职位，并用此方法寻求与发布方联络业务。</p>
      <p>4.除发布者外，删除或修改其他个人或公司公布资料。</p>
      <p>5.擅自打印复制或以其他方式使用有关志愿者的任何个人资料或有关发布方、主办方的商业信息。</p>
      <h3>第五条 暂停使用终止使用</h3>
      <p>任何一位用户经树懒不会上树确定已违反下列行为之一的树懒不会上树有权决定是否给予暂停使用或终止使用的处理:</p>
      <p>1.报名参加志愿者必须守时，不得迟到早退或无故未到，报名志愿者需要退订可在工作时间内(9:00-18:00)且距离报名截止时间提前2天退订。</p>
      <p>2.参加志愿者时听从带队人员安排，遵守纪律。</p>
      <p>3.参加志愿者过程中遇到特殊情况应协商沟通解决，平台维护用户个人权益。</p>
      <p>4.对于迟到、早退根据影响情况给予对应惩罚措施。</p>
      <p>5.报名志愿者无故未到且未退订，根据情况第一次暂停服务1个月，第二次暂停服务3个月，第三次终止服务，永久取消参与资格。</p>
      <p>6.出现工作中找人顶替、将账户转借他人使用、转卖或私自带同学朋友参加服务、以及违纪违法等行为发生的直接终止服务，永久取消参与资格。</p>
      <h3>第六条 发布方和受聘方权益保障</h3>
      <p>树懒不会上树作为第三方，不承担在劳动关系发生期间产生的任何责任和纠纷，但是用户反馈给我们，我们会积极协调，维护用户合法权益。</p>
      <h3>第七条 风险声明</h3>
      <p>1.通过其他非正常渠道报名工作的，树懒不会上树不承担由此产生的责任(如虚假信息、安全保障等)。消息中涉及的任何银行账号、转账、付费等要求，请大家一律拒绝，及时举报，谨防上当受骗。</p>
      <p>2.防止押金、手续费、服装费等任何形式的收费行为，如发生与平台描述不符坚决不要缴纳并第一时间与客服联系。</p>
      <h3>第八条 费用和支付</h3>
      <p>1.因本产品为信息内容，所以关于会员无论您以任何形式充值缴费均无法退款，请慎重。</p>
      <p>2.报名志愿者时不会涉及任何押金费用。</p>
      <p>3.志愿者参与活动结束后30个工作日内发放对应补贴，直接打入志愿者对应微信支付账户。</p>
    </Container>
  </ConfigProvider>
</template>

<script lang="ts" setup>
import ConfigProvider from '@/components/config-provider.vue';
import Container from '@/components/container.vue';
</script>